title: Obfuscated PowerShell Loader
id: ps_lolransom_loader
logsource:
  product: windows
  service: powershell
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains:
      - 'FromBase64String'
      - 'DownloadData'
      - 'Invoke-Expression'
    ScriptBlockText|re: '(?i)[a-z0-9+/]{200,}={0,2}'
  condition: selection
level: high
tags:
  - attack.t1059.001
  - execution
