title: LOLRansom Rundll32 DLL Injection
id: win_lolransom_rundll32_inject
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    Image|endswith: '\rundll32.exe'
    CommandLine|contains:
      - ',RunHTMLApplication'
      - 'script:http'
      - '.dll,'
    ParentImage|endswith:
      - '\explorer.exe'
      - '\winword.exe'
  condition: selection
level: critical
tags:
  - attack.t1218.011
  - execution
