title: LOLBin Persistence Creation
id: win_lolbin_registry_persistence
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 13
    TargetObject|contains:
      - '\Software\Microsoft\Windows\CurrentVersion\Run'
      - '\Software\Microsoft\Windows\CurrentVersion\RunOnce'
    Details|contains:
      - 'mshta.exe'
      - 'regsvr32.exe'
      - 'powershell.exe'
  condition: selection
level: high
tags:
  - attack.t1547.001
  - persistence
